markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stddef.h>

#include <nrf_error.h>

#include "provisioning.h"
#include "prov_pdu.h"

#include "fifo.h"
#include "ticker.h"
#include "utils.h"
#include "log.h"
#include "access.h"
#include "access_config.h"
#include "access_reliable.h"

#include "nrf_mesh.h"
#include "nrf_mesh_events.h"
#include "nrf_mesh_assert.h"

#include "pb_remote_msgs.h"
#include "pb_remote.h"
#include "pb_remote_server.h"

#define __LOG_EVENT(__EVT)                                              \
    if (evt.type != PB_REMOTE_SERVER_EVENT_UNPROV_UUID)                 \
    {                                                                   \
        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "SEvent: %u\n", __EVT); \
    }

#define __LOG_STATE_CHANGE(__PREV_STATE, __NEXT_STATE)  \
    if (__PREV_STATE != __NEXT_STATE)                   \
    {                                                   \
        __LOG(LOG_SRC_ACCESS,                           \
              LOG_LEVEL_DBG1,                           \
              "PB-Mesh Server: \"%u\" -> \"%u\"\n",     \
              __PREV_STATE,                             \
              __NEXT_STATE);                            \
    }

#define PB_REMOTE_SERVER_EVENT_QUEUE_SIZE (2)
#define PB_REMOTE_SERVER_ALT_EVENT_QUEUE_SIZE (2)
/*******************************************************************************
 * Local definitions
 *******************************************************************************/

typedef enum
{
    PB_REMOTE_SERVER_EVENT_SCAN_START,
    PB_REMOTE_SERVER_EVENT_SCAN_START_FILTER,
    PB_REMOTE_SERVER_EVENT_SCAN_CANCEL,
    PB_REMOTE_SERVER_EVENT_SCAN_REPORT_STATUS,
    PB_REMOTE_SERVER_EVENT_LINK_OPEN,
    PB_REMOTE_SERVER_EVENT_LINK_ESTABLISHED,
    PB_REMOTE_SERVER_EVENT_LINK_CLOSE,
    PB_REMOTE_SERVER_EVENT_LINK_CLOSED,
    PB_REMOTE_SERVER_EVENT_LINK_STATUS,
    PB_REMOTE_SERVER_EVENT_UNPROV_UUID,
    PB_REMOTE_SERVER_EVENT_PACKET_TRANSFER,
    PB_REMOTE_SERVER_EVENT_LOCAL_ACK,
    PB_REMOTE_SERVER_EVENT_LOCAL_PACKET,
    PB_REMOTE_SERVER_EVENT_TRANSFER_STATUS,
    PB_REMOTE_SERVER_EVENT_TX_FAILED,
    PB_REMOTE_SERVER_EVENT_LAST       /**< Used to set the size of the event handler list. */
} pb_remote_server_event_type_t;

typedef struct
{
    uint16_t length;
    uint8_t payload[PROV_PDU_MAX_LENGTH];
} pb_remote_event_pb_adv_pdu_t;

typedef struct
{
    pb_remote_server_event_type_t type;
    union
    {
        pb_remote_event_pb_adv_pdu_t pdu;
        const access_message_rx_t * p_message;
        nrf_mesh_evt_unprov_recv_t unprov;
        nrf_mesh_prov_link_close_reason_t link_close_reason;
    } evt;
} pb_remote_server_event_t;

typedef struct
{
    bool slot_active;
    uint8_t uuid[NRF_MESH_UUID_SIZE];
} pb_remote_uuid_slot_t;

typedef pb_remote_server_state_t (*pb_remote_server_event_handler_cb_t)(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);

typedef struct
{
    uint16_t opcode;
    uint16_t length;
    pb_remote_server_event_type_t event_type;
} message_length_lut_t;

/*******************************************************************************
 * Static variables
 *******************************************************************************/


static void remote_server_access_rx_cb(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args);

/* TODO: If possible, the each of the opcodes should be handled in their event callback directly,
 * but that would require a bigger re-work of the design. */
static const access_opcode_handler_t m_opcode_handlers[] =
{
    {{PB_REMOTE_OP_PACKET_TRANSFER,                  ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_PACKET_TRANSFER_STATUS,           ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_LINK_CLOSE,                       ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_LINK_OPEN,                        ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_LINK_STATUS,                      ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_SCAN_START,                       ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_SCAN_CANCEL,                      ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_SCAN_START_FILTER,                ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb},
    {{PB_REMOTE_OP_SCAN_REPORT_STATUS,               ACCESS_COMPANY_ID_NONE}, remote_server_access_rx_cb}
};

