markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
/* Forward declarations */
static pb_remote_server_state_t pb_remote_server_event_scan_start_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_scan_start_filter_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_scan_cancel_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_scan_report_status_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_link_open_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_link_established_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_link_close_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_link_closed_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_link_status_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_unprov_uuid_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_packet_transfer_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_local_ack_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_local_packet_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_transfer_status_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static pb_remote_server_state_t pb_remote_server_event_tx_failed_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt);
static void pb_adv_rx_cb(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length);
static void pb_adv_ack_cb(prov_bearer_t * p_bearer);
static void pb_adv_link_opened_cb(prov_bearer_t * p_bearer);
static void pb_adv_link_closed_cb(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t reason);

static const pb_remote_server_event_handler_cb_t
m_pb_remote_server_event_handler_callbacks[PB_REMOTE_SERVER_EVENT_LAST] =
{
    pb_remote_server_event_scan_start_cb,
    pb_remote_server_event_scan_start_filter_cb,
    pb_remote_server_event_scan_cancel_cb,
    pb_remote_server_event_scan_report_status_cb,
    pb_remote_server_event_link_open_cb,
    pb_remote_server_event_link_established_cb,
    pb_remote_server_event_link_close_cb,
    pb_remote_server_event_link_closed_cb,
    pb_remote_server_event_link_status_cb,
    pb_remote_server_event_unprov_uuid_cb,
    pb_remote_server_event_packet_transfer_cb,
    pb_remote_server_event_local_ack_cb,
    pb_remote_server_event_local_packet_cb,
    pb_remote_server_event_transfer_status_cb,
    pb_remote_server_event_tx_failed_cb
};

static const prov_bearer_callbacks_t m_prov_callbacks =
{
    pb_adv_rx_cb,
    pb_adv_ack_cb,
    pb_adv_link_opened_cb,
    pb_adv_link_closed_cb
};

static pb_remote_server_t * mp_pb_remote_server_model;
static pb_remote_uuid_slot_t m_uuid_list[NRF_MESH_PROV_MESH_SERVER_UUID_LIST_SIZE];
static nrf_mesh_evt_handler_t m_event_handler;

/** Buffer for storing reliable packet. */
static union
{
    pb_remote_packet_t packet;
    uint8_t buffer[PROV_PDU_MAX_LENGTH];
} m_packet;

static pb_remote_server_event_t m_pbr_server_event_queue_buffer[PB_REMOTE_SERVER_EVENT_QUEUE_SIZE];
static fifo_t m_pbr_server_event_queue;

static pb_remote_server_event_t m_pbr_server_alt_event_queue_buffer[PB_REMOTE_SERVER_ALT_EVENT_QUEUE_SIZE];
static fifo_t m_pbr_server_alt_event_queue;

static bool m_is_interrupting;

static void pb_remote_server_process(pb_remote_server_t * p_ctx);

/*******************************************************************************
 * Static functions
 *******************************************************************************/

static inline void send_msg(const pb_remote_server_t * p_ctx, const access_message_tx_t * p_tx_msg)
{
    uint32_t status = access_model_publish(p_ctx->model_handle, p_tx_msg);
    NRF_MESH_ASSERT(NRF_SUCCESS == status || NRF_ERROR_NO_MEM == status);
}

static inline void send_reliable_msg(pb_remote_server_t * p_ctx, pb_remote_opcode_t opcode, pb_remote_opcode_t reply_opcode, uint16_t length)
{
    p_ctx->reliable.message.opcode.opcode = opcode;
    p_ctx->reliable.message.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    p_ctx->reliable.message.p_buffer = m_packet.buffer;
    p_ctx->reliable.message.length = length;
    p_ctx->reliable.reply_opcode.opcode = reply_opcode;
    p_ctx->reliable.reply_opcode.company_id = ACCESS_COMPANY_ID_NONE;

    NRF_MESH_ASSERT(access_model_reliable_publish(&p_ctx->reliable) == NRF_SUCCESS);
}

static inline void send_reply(const pb_remote_server_t * p_ctx, const access_message_rx_t * p_rx_msg, const access_message_tx_t * p_reply)
{
    uint32_t status = access_model_reply(p_ctx->model_handle, p_rx_msg, p_reply);
    NRF_MESH_ASSERT(NRF_SUCCESS == status || NRF_ERROR_NO_MEM == status);
}

static void do_state_change(pb_remote_server_t * p_ctx, pb_remote_server_state_t next_state)
{
    if (next_state != p_ctx->state)
    {
        p_ctx->prev_state = p_ctx->state;
        p_ctx->state      = next_state;
        __LOG_STATE_CHANGE(p_ctx->prev_state, p_ctx->state);
    }
}

/**
 *  Relays a message from the client over the local PB-ADV link.
 *
 *  If unsuccessful, an attempt to close the link is made.
 *
 *  @param[in] p_ctx Remote server context structure.
 *  @param[in] p_evt Remote server event pointer.
 *
 *  @returns The next state of the server based on whether the packet was relayed successfully or
 *  the link was closed successfully.
 */
static pb_remote_server_state_t relay_to_pb_adv_with_ack(pb_remote_server_t * p_ctx,
                                                         pb_remote_server_event_t * p_evt,
                                                         access_message_tx_t * p_reply,
                                                         pb_remote_msg_packet_transfer_status_t * p_transfer_status)
{
    pb_remote_msg_packet_transfer_t * p_packet_transfer = (pb_remote_msg_packet_transfer_t *) &p_evt->evt.p_message->p_data[0];
    if (prov_tx(&p_ctx->prov_bearer,
                &p_packet_transfer->buffer[0],
                p_evt->evt.p_message->length) == NRF_SUCCESS)
    {
        p_transfer_status->status = PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED;
        send_reply(p_ctx, p_evt->evt.p_message, p_reply);
        return PB_REMOTE_SERVER_STATE_WAIT_FOR_LOCAL_ACK;
    }
    else
    {
        prov_link_close(&p_ctx->prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
        p_transfer_status->status = PB_REMOTE_PACKET_TRANSFER_STATUS_CANNOT_ACCEPT_BUFFER;
        send_reply(p_ctx, p_evt->evt.p_message, p_reply);
        /* The link is closing. When the link_closed callback is called, we will notify the client
         * of the closed link with a LINK_STATUS_REPORT and return to IDLE/SCANNING. */
        return PB_REMOTE_SERVER_STATE_WAIT_LINK_CLOSING;
    }
}

