markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
static void server_reliable_status_cb(access_model_handle_t model_handle, void * p_args, access_reliable_status_t status)
{
    NRF_MESH_ASSERT(NULL != p_args);
    pb_remote_server_t * p_self = p_args;

    switch (status)
    {
        case ACCESS_RELIABLE_TRANSFER_SUCCESS:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Got ACK for [aop: 0x%04x]", p_self->reliable.message.opcode.opcode);
            break;

        case ACCESS_RELIABLE_TRANSFER_TIMEOUT:
        {
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unable to send message [aop: 0x%04x]", p_self->reliable.message.opcode.opcode);
            pb_remote_server_event_t event = {.type = PB_REMOTE_SERVER_EVENT_TX_FAILED};
            NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &event) == NRF_SUCCESS);
            pb_remote_server_process(p_self);
            break;
        }
        default:
            NRF_MESH_ASSERT(false);
            break;
    }

}

static pb_remote_server_state_t pb_remote_server_event_tx_failed_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_LINK_OPENING:
            /* fall through */
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
        {
            /* We couldn't send the reliable message. */
            /** @todo Should we give an event to the application here? */

            /* Close the link: */
            prov_link_close(&p_ctx->prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);

            /* Re-init the fifo to flush all enqueued PB-ADV packets. No reason to try to send them
             * if TX failed. */
            fifo_flush(&m_pbr_server_alt_event_queue);
            return PB_REMOTE_SERVER_STATE_IDLE;
        }
        default:
            /* We should not be getting this event in any other state(s). */
            NRF_MESH_ASSERT(false);
            return PB_REMOTE_SERVER_STATE_IDLE;
    }
}

static pb_remote_server_state_t pb_remote_server_event_scan_start_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_SCANNING_FILTER:
            /* Switch to unfiltered mode. */
            /* fall through. */
        case PB_REMOTE_SERVER_STATE_SCANNING:
            /* fall through */
        case PB_REMOTE_SERVER_STATE_IDLE:
        {
            memset(&m_uuid_list[0], 0, sizeof(m_uuid_list));
            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_STARTED};
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &scan_status;
            reply.length = sizeof(scan_status);
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            return PB_REMOTE_SERVER_STATE_SCANNING;
        }
        default:
        {
            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_CANNOT_START_SCANNING};
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &scan_status;
            reply.length = sizeof(scan_status);
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            return p_ctx->state;
        }
    }
}


static pb_remote_server_state_t pb_remote_server_event_scan_start_filter_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_SCANNING:
            /* fall through */
        case PB_REMOTE_SERVER_STATE_IDLE:
            /* fall through */
        case PB_REMOTE_SERVER_STATE_SCANNING_FILTER:
        {
            pb_remote_msg_scan_start_filter_t * p_filter_msg = (pb_remote_msg_scan_start_filter_t *)
                (&p_evt->evt.p_message->p_data);

            __LOG_XB(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Adding filter", p_filter_msg->filter_uuid, NRF_MESH_UUID_SIZE);
            memcpy(&m_uuid_list[0].uuid[0], &p_filter_msg->filter_uuid[0], NRF_MESH_UUID_SIZE);

            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_STARTED};
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &scan_status;
            reply.length = sizeof(scan_status);
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            return PB_REMOTE_SERVER_STATE_SCANNING_FILTER;
        }
        default:
        {
            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_CANNOT_START_SCANNING};
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &scan_status;
            reply.length = sizeof(scan_status);

            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            return p_ctx->state;
        }
    }
}

static pb_remote_server_state_t pb_remote_server_event_scan_cancel_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_SCANNING_FILTER:
            /* fall through. */
        case PB_REMOTE_SERVER_STATE_SCANNING:
        {
            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_CANCELED};
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &scan_status;
            reply.length = sizeof(scan_status);
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            return PB_REMOTE_SERVER_STATE_IDLE;
        }

        default:
        {
            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_CANNOT_CANCEL_SCANNING};
            access_message_tx_t reply;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t *) &scan_status;
            reply.length = sizeof(scan_status);
            send_reply(p_ctx, p_evt->evt.p_message, &reply);

            return p_ctx->state;
        }
    }
}

static pb_remote_server_state_t pb_remote_server_event_scan_report_status_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_SCAN_REPORT_STATUS)
            {
                return p_ctx->prev_state;
            }
            else
            {
                return p_ctx->state;
            }
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "Unknown event %u in state %u\n", p_evt->type, p_ctx->state);
            return p_ctx->state;
    }
}


static pb_remote_server_state_t pb_remote_server_event_link_open_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    pb_remote_msg_link_open_t * p_pb_remote_msg = (pb_remote_msg_link_open_t *) &p_evt->evt.p_message->p_data[0];
    access_message_tx_t reply;
    pb_remote_msg_link_status_t link_status;
    reply.opcode.opcode = PB_REMOTE_OP_LINK_STATUS;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reply.p_buffer = (const uint8_t *)&link_status;
    reply.length = sizeof(link_status);

