markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
        {
            /* The only way we can be in this state without an open link, is if we are waiting for
             * the ACK for a Scan Report or Link Status Report with closed link status. In both
             * cases it is safe to open a new link and cancel the current transmission.
             */

            /* @todo This is naughty. We should track our own state properly. */
            if (p_ctx->prov_bearer.bearer.pb_adv.state == PROV_BEARER_ADV_STATE_LINK_OPENING ||
                p_ctx->prov_bearer.bearer.pb_adv.state == PROV_BEARER_ADV_STATE_LINK_OPEN)
            {
                /* No link open in a connection! */
                link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_ALREADY_OPEN;
                link_status.bearer_type = PB_REMOTE_BEARER_TYPE_PB_ADV;
                send_reply(p_ctx, p_evt->evt.p_message, &reply);
                return p_ctx->state;
            }

            NRF_MESH_ASSERT(access_model_reliable_cancel(p_ctx->model_handle) == NRF_SUCCESS);
        }
        /* fall through */
        case PB_REMOTE_SERVER_STATE_SCANNING_FILTER:
            /* In this state you would only have one UUID in the list and all other
             * slots inactive. Should be safe to fall through :) */

            /* fall through */
        case PB_REMOTE_SERVER_STATE_IDLE:
        case PB_REMOTE_SERVER_STATE_SCANNING:
        {
            if (p_pb_remote_msg->unprov_device_id >= NRF_MESH_PROV_MESH_SERVER_UUID_LIST_SIZE ||
                !m_uuid_list[p_pb_remote_msg->unprov_device_id].slot_active)
            {
                link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_INVALID_UNPROV_DEVICE_ID;
                link_status.bearer_type = PB_REMOTE_BEARER_TYPE_PB_ADV;
                send_reply(p_ctx, p_evt->evt.p_message, &reply);
                return p_ctx->state;
            }
            p_ctx->ctid = 0xFF;
            uint8_t * p_target_uuid = &m_uuid_list[p_pb_remote_msg->unprov_device_id].uuid[0];
            uint32_t status = prov_link_open(&p_ctx->prov_bearer,
                                             p_target_uuid);
            if (status != NRF_SUCCESS)
            {
                __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "[er%u] Establishing local PB-ADV link\n", status);

                m_packet.packet.link_status_report.status = PB_REMOTE_LINK_STATUS_REPORT_CLOSED;
                m_packet.packet.link_status_report.reason = NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR;
                send_reliable_msg(p_ctx,
                                  PB_REMOTE_OP_LINK_STATUS_REPORT,
                                  PB_REMOTE_OP_LINK_STATUS,
                                  sizeof(pb_remote_msg_link_status_report_t));
                return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
            }

            link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_OPENING;
            link_status.bearer_type = PB_REMOTE_BEARER_TYPE_PB_ADV;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return PB_REMOTE_SERVER_STATE_LINK_OPENING;
        }
        case PB_REMOTE_SERVER_STATE_LINK_OPENING:
            link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_OPENING;
            link_status.bearer_type = PB_REMOTE_BEARER_TYPE_PB_ADV;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;

        case PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED:
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_LOCAL_ACK:
        {
            link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_ALREADY_OPEN;
            link_status.bearer_type = PB_REMOTE_BEARER_TYPE_PB_ADV;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;
        }
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "No link open action.\n");
            return p_ctx->state;
    }
}

static pb_remote_server_state_t pb_remote_server_event_link_established_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_LINK_OPENING:
        {
            m_packet.packet.link_status_report.status = PB_REMOTE_LINK_STATUS_REPORT_OPENED;
            m_packet.packet.link_status_report.reason = BEARER_LINK_REASON_NOT_SUPPORTED;
            send_reliable_msg(p_ctx,
                              PB_REMOTE_OP_LINK_STATUS_REPORT,
                              PB_REMOTE_OP_LINK_STATUS,
                              sizeof(pb_remote_msg_link_status_report_t));

            return PB_REMOTE_SERVER_STATE_LINK_OPENING;
        }

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Got unexpected link established in state: %u.\n", p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_server_state_t pb_remote_server_event_link_close_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    access_message_tx_t reply;
    pb_remote_msg_link_status_t link_status;
    pb_remote_msg_link_close_t * p_msg = (pb_remote_msg_link_close_t *) &p_evt->evt.p_message->p_data[0];
    /* TODO: This should be sanitized at input and NACKed if the input is invalid. */
    nrf_mesh_prov_link_close_reason_t close_reason =
        (p_msg->reason <= NRF_MESH_PROV_LINK_CLOSE_REASON_LAST ?
         (nrf_mesh_prov_link_close_reason_t) p_msg->reason : NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);

    reply.opcode.opcode = PB_REMOTE_OP_LINK_STATUS;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reply.p_buffer = (const uint8_t*) &link_status;
    reply.length = sizeof(link_status);

    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_SCAN_REPORT_STATUS)
            {
                /* We're scanning and the Close command doesn't make sense... */
                link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_LINK_NOT_ACTIVE;
                send_reply(p_ctx, p_evt->evt.p_message, &reply);
                return p_ctx->state;
            }

            NRF_MESH_ASSERT(access_model_reliable_cancel(p_ctx->model_handle) == NRF_SUCCESS);
            /* fall through */
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_LOCAL_ACK:
            /* fall through */
        case PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED:
            prov_link_close(&p_ctx->prov_bearer, close_reason);
            link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_ACCEPTED;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            /* Wait for the closed callback.  */
            return PB_REMOTE_SERVER_STATE_WAIT_LINK_CLOSING;
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got link close in state: %u\n", p_ctx->state);
            link_status.status = PB_REMOTE_REMOTE_LINK_STATUS_LINK_NOT_ACTIVE;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;
    }

