markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
}

static pb_remote_server_state_t pb_remote_server_event_link_closed_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_LINK_OPENING:
        {
            /* We don't really care if there is an ongoing TX or not, so try to remove it if it is ongoing. */
            uint32_t status = access_model_reliable_cancel(p_ctx->model_handle);
            NRF_MESH_ASSERT(status == NRF_SUCCESS || status == NRF_ERROR_NOT_FOUND);

            m_packet.packet.link_status_report.status = PB_REMOTE_LINK_STATUS_REPORT_OPEN_TIMEOUT;
            m_packet.packet.link_status_report.reason = p_evt->evt.link_close_reason;
            send_reliable_msg(p_ctx,
                              PB_REMOTE_OP_LINK_STATUS_REPORT,
                              PB_REMOTE_OP_LINK_STATUS,
                              sizeof(pb_remote_msg_link_status_report_t));

            return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
        }
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
            /* The ACK should trigger this event again. */
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Queueing event %u\n", p_evt->type);
            NRF_MESH_ASSERT(fifo_push(&m_pbr_server_alt_event_queue, p_evt) == NRF_SUCCESS);
            return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;

        case PB_REMOTE_SERVER_STATE_WAIT_LINK_CLOSING:
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_LOCAL_ACK:
        case PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED:
        {
            m_packet.packet.link_status_report.status = PB_REMOTE_LINK_STATUS_REPORT_OPEN_TIMEOUT;
            if (p_evt->evt.link_close_reason == NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS)
            {
                m_packet.packet.link_status_report.status = PB_REMOTE_LINK_STATUS_REPORT_CLOSED;
            }
            else
            {
                m_packet.packet.link_status_report.status = PB_REMOTE_LINK_STATUS_REPORT_CLOSED_BY_DEVICE;
            }
            m_packet.packet.link_status_report.reason = p_evt->evt.link_close_reason;
            send_reliable_msg(p_ctx,
                              PB_REMOTE_OP_LINK_STATUS_REPORT,
                              PB_REMOTE_OP_LINK_STATUS,
                              sizeof(pb_remote_msg_link_status_report_t));

            return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
        }
        default:
            return PB_REMOTE_SERVER_STATE_IDLE;
    }
}

static pb_remote_server_state_t pb_remote_server_event_link_status_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    pb_remote_msg_link_status_t * p_link_status = (pb_remote_msg_link_status_t *) &p_evt->evt.p_message->p_data[0];
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_LINK_STATUS)
            {
                if (p_link_status->status == PB_REMOTE_REMOTE_LINK_STATUS_ACCEPTED)
                {
                    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Client accepted close.\n");
                    return PB_REMOTE_SERVER_STATE_IDLE;
                }
                else
                {
                    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Client rejected the close.\n");
                    return PB_REMOTE_SERVER_STATE_IDLE;
                }
            }
            else
            {
                return p_ctx->state;
            }
        case PB_REMOTE_SERVER_STATE_LINK_OPENING:
            if (p_link_status->status == PB_REMOTE_REMOTE_LINK_STATUS_ACCEPTED)
            {
                __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Client accepted open.\n");
                return PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED;
            }
            else
            {
                __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Client rejected the open %u.\n", p_link_status->status);
                prov_link_close(&p_ctx->prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
                /* Wait for the closed callback to send the link status report. */
                return PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED;
            }
        default:
        {
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Unexpected LINK_STATUS in state %d\n", p_ctx->state);
            return p_ctx->state;
        }
    }
}

static pb_remote_server_state_t pb_remote_server_event_unprov_uuid_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_SCANNING:
        {
            for (int i = 0; i < NRF_MESH_PROV_MESH_SERVER_UUID_LIST_SIZE; ++i)
            {
                if (m_uuid_list[i].slot_active &&
                    memcmp(&m_uuid_list[i].uuid[0],
                           &p_evt->evt.unprov.device_uuid[0],
                           NRF_MESH_UUID_SIZE) == 0)
                {
                    /* Item already in list. */
                    return p_ctx->state;
                }
            }

            for (int i = 0; i < NRF_MESH_PROV_MESH_SERVER_UUID_LIST_SIZE; ++i)
            {

                if (!m_uuid_list[i].slot_active)
                {
                    m_uuid_list[i].slot_active = true;

                    memcpy(&m_uuid_list[i].uuid[0],
                           &p_evt->evt.unprov.device_uuid[0],
                           NRF_MESH_UUID_SIZE);

                    memcpy(&m_packet.packet.scan_uuid_report.uuid[0],
                           &p_evt->evt.unprov.device_uuid[0],
                           NRF_MESH_UUID_SIZE);
                    m_packet.packet.scan_uuid_report.unprov_device_id = i;

                    send_reliable_msg(p_ctx,
                                      PB_REMOTE_OP_SCAN_UUID_REPORT,
                                      PB_REMOTE_OP_SCAN_REPORT_STATUS,
                                      sizeof(pb_remote_msg_scan_uuid_report_t));

                    return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
                }
            }

            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "No more slots for UUIDs\n");
            access_message_tx_t reply;
            pb_remote_msg_scan_status_t scan_status = {.status = PB_REMOTE_SCAN_STATUS_CANCELED};
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
            reply.p_buffer = (const uint8_t*) &scan_status;
            reply.length = sizeof(scan_status);
            send_msg(p_ctx, &reply);
            return PB_REMOTE_SERVER_STATE_IDLE;
        }
        case PB_REMOTE_SERVER_STATE_SCANNING_FILTER:
            /* Filter is saved at position '0' in the list */
            if (memcmp(&m_uuid_list[0].uuid[0],
                       &p_evt->evt.unprov.device_uuid[0],
                       NRF_MESH_UUID_SIZE) == 0)
            {
                memcpy(&m_packet.packet.scan_uuid_report.uuid[0],
                       &p_evt->evt.unprov.device_uuid[0],
                       NRF_MESH_UUID_SIZE);
                m_packet.packet.scan_uuid_report.unprov_device_id = 0;

                send_reliable_msg(p_ctx,
                                  PB_REMOTE_OP_SCAN_UUID_REPORT,
                                  PB_REMOTE_OP_SCAN_REPORT_STATUS,
                                  sizeof(pb_remote_msg_scan_uuid_report_t));

