markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
                return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
            }
            else
            {
                return p_ctx->state;
            }

        default:
            return p_ctx->state;
    }
}

static pb_remote_server_state_t pb_remote_server_event_packet_transfer_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    access_message_tx_t reply;
    pb_remote_msg_packet_transfer_status_t packet_transfer_status;
    reply.opcode.opcode = PB_REMOTE_OP_PACKET_TRANSFER_STATUS;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;
    reply.p_buffer = (const uint8_t*) &packet_transfer_status;
    reply.length = sizeof(packet_transfer_status);

    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_LINK_OPENING:
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
            return p_ctx->state;

        case PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED:
        {
            pb_remote_msg_packet_transfer_t * p_packet_transfer = (pb_remote_msg_packet_transfer_t *) &p_evt->evt.p_message->p_data[0];
            if (p_packet_transfer->buffer[0] != p_ctx->ctid)
            {
                p_ctx->ctid = p_packet_transfer->buffer[0];
                return relay_to_pb_adv_with_ack(p_ctx, p_evt, &reply, &packet_transfer_status);
            }
        }
        /* fall through */
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_LOCAL_ACK:
            /** @todo Assume this was the previous buffer? If not the following is a complete lie. */
            packet_transfer_status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;

        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got unexpected packet transfer in state %u.\n", p_ctx->state);
            packet_transfer_status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_LINK_NOT_ACTIVE;
            send_reply(p_ctx, p_evt->evt.p_message, &reply);
            return p_ctx->state;
    }
}

static pb_remote_server_state_t pb_remote_server_event_local_ack_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_LOCAL_ACK:
        {
            m_packet.packet.packet_transfer_report.status = PB_REMOTE_PACKET_TRANSFER_DELIVERY_STATUS_DELIVERED;
            send_reliable_msg(p_ctx,
                              PB_REMOTE_OP_PACKET_TRANSFER_REPORT,
                              PB_REMOTE_OP_PACKET_TRANSFER_STATUS,
                              sizeof(pb_remote_msg_packet_transfer_report_t));

            return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
        }
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_WARN, "Got ACK in state %u.\n", p_ctx->state);
            return p_ctx->state;
    }
}

static pb_remote_server_state_t pb_remote_server_event_local_packet_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Local packet [ppdu%x]\n", p_evt->evt.pdu.payload[0]);
    switch (p_ctx->state)
    {
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Queueing event %u\n", p_evt->type);
            NRF_MESH_ASSERT(fifo_push(&m_pbr_server_alt_event_queue, p_evt) == NRF_SUCCESS);
            return p_ctx->state;

        case PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED:
        {
            /* TODO: We have to copy the data to make room for the opcode. Can
             * we avoid it somehow? */
            NRF_MESH_ASSERT(p_evt->evt.pdu.length <= PROV_PDU_MAX_LENGTH);

            memcpy(&m_packet.packet.packet_transfer.buffer[0],
                   &p_evt->evt.pdu.payload[0],
                   p_evt->evt.pdu.length);
            send_reliable_msg(p_ctx,
                              PB_REMOTE_OP_PACKET_TRANSFER,
                              PB_REMOTE_OP_PACKET_TRANSFER_STATUS,
                              p_evt->evt.pdu.length);

            return PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK;
        }

        default:
            NRF_MESH_ASSERT(false);
            /* Should never be possible. */
            return PB_REMOTE_SERVER_STATE_IDLE;
    }
}


static pb_remote_server_state_t pb_remote_server_event_transfer_status_cb(pb_remote_server_t * p_ctx, pb_remote_server_event_t * p_evt)
{
    pb_remote_msg_packet_transfer_status_t * p_msg = (pb_remote_msg_packet_transfer_status_t *) &p_evt->evt.p_message->p_data[0];
    switch (p_ctx->state)
    {
        /**@todo What if we're waiting for another ack? */
        case PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK:
        {
            if (p_ctx->reliable.reply_opcode.opcode == PB_REMOTE_OP_PACKET_TRANSFER_STATUS)
            {
                switch (p_msg->status)
                {
                    case PB_REMOTE_PACKET_TRANSFER_STATUS_BUFFER_ACCEPTED:
                    case PB_REMOTE_PACKET_TRANSFER_STATUS_ACCEPTED:
                        return PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED;

                    case PB_REMOTE_PACKET_TRANSFER_STATUS_CANNOT_ACCEPT_BUFFER:
                    case PB_REMOTE_PACKET_TRANSFER_STATUS_LINK_NOT_ACTIVE:
                        prov_link_close(&p_ctx->prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
                        /* Go to IDLE in all cases and ignore the LINK_CLOSED event. */
                        return PB_REMOTE_SERVER_STATE_IDLE;

                    default:
                        __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "Got transfer status %u.\n", p_msg->status);
                        return p_ctx->state;
                }
            }
            else
            {
                return p_ctx->state;
            }
        }
        default:
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_INFO, "Got transfer status %u in state %u.\n", p_msg->status, p_ctx->state);
            return p_ctx->state;
    }
}

static void pb_remote_server_process(pb_remote_server_t * p_ctx)
{
    if (m_is_interrupting)
    {
        /* Event is queued. */
        return;
    }
    m_is_interrupting = true;

    pb_remote_server_event_t evt;
    uint32_t alt_evt_queue_len = fifo_get_len(&m_pbr_server_alt_event_queue);

    while (fifo_pop(&m_pbr_server_event_queue, &evt) == NRF_SUCCESS)
    {
        if (evt.type != PB_REMOTE_SERVER_EVENT_UNPROV_UUID)
        {
            __LOG_EVENT(evt.type);
        }
        pb_remote_server_state_t next_state = m_pb_remote_server_event_handler_callbacks[evt.type](p_ctx, &evt);
        do_state_change(p_ctx, next_state);
    }

    /* If there are events in the other queue and it was not pushed by the incoming event itself. */
    if (evt.type != PB_REMOTE_SERVER_EVENT_UNPROV_UUID &&
        alt_evt_queue_len > 0 &&
        alt_evt_queue_len == fifo_get_len(&m_pbr_server_alt_event_queue))
    {
        NRF_MESH_ASSERT(fifo_pop(&m_pbr_server_alt_event_queue, &evt) == NRF_SUCCESS);
        __LOG_EVENT(evt.type);

        pb_remote_server_state_t next_state = m_pb_remote_server_event_handler_callbacks[evt.type](p_ctx, &evt);
        do_state_change(p_ctx, next_state);
    }

