markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
    if (p_ctx->return_to_scan_enabled &&
        evt.type != PB_REMOTE_SERVER_EVENT_UNPROV_UUID &&
        evt.type != PB_REMOTE_SERVER_EVENT_TX_FAILED &&
        p_ctx->state == PB_REMOTE_SERVER_STATE_IDLE)
    {
        evt.type = PB_REMOTE_SERVER_EVENT_SCAN_START;
        /* Don't need the other stuff */
        __LOG_EVENT(evt.type);
        pb_remote_server_state_t next_state = PB_REMOTE_SERVER_STATE_SCANNING;
        memset(&m_uuid_list[0], 0, sizeof(m_uuid_list));
        do_state_change(p_ctx, next_state);
    }

    m_is_interrupting = false;
}

static bool is_valid_message(const access_message_rx_t * p_message, pb_remote_server_event_type_t * p_evt_type)
{
    const message_length_lut_t message_length_LUT[] =
        {{PB_REMOTE_OP_LINK_CLOSE            , sizeof(pb_remote_msg_link_close_t)            , PB_REMOTE_SERVER_EVENT_LINK_CLOSE},
         {PB_REMOTE_OP_LINK_OPEN             , sizeof(pb_remote_msg_link_open_t)             , PB_REMOTE_SERVER_EVENT_LINK_OPEN},
         {PB_REMOTE_OP_SCAN_START            , 0                                             , PB_REMOTE_SERVER_EVENT_SCAN_START},
         {PB_REMOTE_OP_SCAN_START_FILTER     , sizeof(pb_remote_msg_scan_start_filter_t)     , PB_REMOTE_SERVER_EVENT_SCAN_START_FILTER},
         {PB_REMOTE_OP_SCAN_CANCEL           , 0                                             , PB_REMOTE_SERVER_EVENT_SCAN_CANCEL},
         {PB_REMOTE_OP_SCAN_REPORT_STATUS    , sizeof(pb_remote_msg_scan_report_status_t)    , PB_REMOTE_SERVER_EVENT_SCAN_REPORT_STATUS},
         {PB_REMOTE_OP_PACKET_TRANSFER_STATUS, sizeof(pb_remote_msg_packet_transfer_status_t), PB_REMOTE_SERVER_EVENT_TRANSFER_STATUS},
         {PB_REMOTE_OP_LINK_STATUS           , sizeof(pb_remote_msg_link_status_t)           , PB_REMOTE_SERVER_EVENT_LINK_STATUS}};

    if (PB_REMOTE_OP_PACKET_TRANSFER == p_message->opcode.opcode)
    {
        *p_evt_type = PB_REMOTE_SERVER_EVENT_PACKET_TRANSFER;
        return (p_message->length > 0 &&
                p_message->length <= PROV_PDU_MAX_LENGTH);
    }


    for (uint32_t i = 0; i < sizeof(message_length_LUT) / sizeof(message_length_lut_t); ++i)
    {
        if (p_message->opcode.opcode == message_length_LUT[i].opcode)
        {
            if (message_length_LUT[i].length == p_message->length)
            {
                *p_evt_type = message_length_LUT[i].event_type;
                return true;
            }
            else
            {
                return false;
            }
        }
    }
    /* Could not find the message. */
    return false;
}

static bool is_valid_source(const pb_remote_server_t * p_ctx, const access_message_rx_t * p_message)
{
    dsm_handle_t publish_handle = DSM_HANDLE_INVALID;
    nrf_mesh_address_t publish_address;
    if (access_model_publish_address_get(p_ctx->model_handle, &publish_handle) != NRF_SUCCESS||
        publish_handle == DSM_HANDLE_INVALID ||
        dsm_address_get(publish_handle, &publish_address) != NRF_SUCCESS ||
        publish_address.value != p_message->meta_data.src.value)
    {
        return false;
    }
    else
    {
        return true;
    }
}

static void nack_message(const pb_remote_server_t * p_ctx, const access_message_rx_t * p_message)
{
    access_message_tx_t reply;
    reply.opcode.company_id = ACCESS_COMPANY_ID_NONE;

    switch (p_message->opcode.opcode)
    {
        case PB_REMOTE_OP_PACKET_TRANSFER:
        {
            pb_remote_msg_packet_transfer_status_t status;
            status.status = PB_REMOTE_PACKET_TRANSFER_STATUS_REJECTED;
            reply.opcode.opcode = PB_REMOTE_OP_PACKET_TRANSFER_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
            break;
        }
        case PB_REMOTE_OP_LINK_CLOSE:
        case PB_REMOTE_OP_LINK_OPEN:
        {
            pb_remote_msg_packet_transfer_status_t status;
            status.status = PB_REMOTE_REMOTE_LINK_STATUS_REJECTED;
            reply.opcode.opcode = PB_REMOTE_OP_LINK_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
            break;
        }
        case PB_REMOTE_OP_SCAN_START:
        case PB_REMOTE_OP_SCAN_START_FILTER:
        {
            pb_remote_msg_scan_status_t status;
            status.status = PB_REMOTE_SCAN_STATUS_CANNOT_START_SCANNING;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
            break;
        }
        case PB_REMOTE_OP_SCAN_CANCEL:
        {
            pb_remote_msg_scan_status_t status;
            status.status = PB_REMOTE_SCAN_STATUS_CANNOT_CANCEL_SCANNING;
            reply.opcode.opcode = PB_REMOTE_OP_SCAN_STATUS;
            reply.p_buffer = (const uint8_t*) &status;
            reply.length = sizeof(status);
            send_reply(p_ctx, p_message, &reply);
            break;
        }
        case PB_REMOTE_OP_PACKET_TRANSFER_STATUS:
        case PB_REMOTE_OP_LINK_STATUS:
        case PB_REMOTE_OP_SCAN_REPORT_STATUS:
            break;

        default:
            NRF_MESH_ASSERT(false);
            break;
    }
}

static void remote_server_access_rx_cb(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    NRF_MESH_ASSERT(NULL != p_args);

    pb_remote_server_t * p_ctx = (pb_remote_server_t*) p_args;
    NRF_MESH_ASSERT(p_ctx->model_handle == handle);
    pb_remote_server_event_t evt;

    if (!is_valid_message(p_message, &evt.type))
    {
        return;
    }
    else if (!is_valid_source(p_ctx, p_message))
    {
        nack_message(p_ctx, p_message);
    }
    else
    {
        evt.evt.p_message = p_message;
        NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &evt) == NRF_SUCCESS);
        pb_remote_server_process(p_ctx);
    }
}

static void pb_remote_server_mesh_evt_cb(nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_UNPROVISIONED_RECEIVED:
        {
            pb_remote_server_event_t pb_remote_evt;
            pb_remote_evt.type = PB_REMOTE_SERVER_EVENT_UNPROV_UUID;
            memcpy(&pb_remote_evt.evt.unprov, &p_evt->params.unprov_recv, sizeof(p_evt->params.unprov_recv));

            NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &pb_remote_evt) == NRF_SUCCESS);

            /* TODO: How to find the models that would need this? MBTLE-994 */
            pb_remote_server_process(mp_pb_remote_server_model);
            break;
        }

        default:
            break;
    }
}

