markluo0311/nrf52832_bt_mesh/mesh/models/pb_remote/src/pb_remote_server.c
/*******************************************************************************
 * Provisioning callback functions
 *******************************************************************************/

static void pb_adv_rx_cb(prov_bearer_t * p_bearer, const uint8_t * p_data, uint16_t length)
{
    /* TODO: Find server model with correct provisioning context. MBTLE-994 */
    if (&mp_pb_remote_server_model->prov_bearer == p_bearer &&
        (mp_pb_remote_server_model->state == PB_REMOTE_SERVER_STATE_LINK_ESTABLISHED ||
         mp_pb_remote_server_model->state == PB_REMOTE_SERVER_STATE_WAIT_FOR_REMOTE_ACK))
    {
        pb_remote_server_event_t pb_remote_evt;

        pb_remote_evt.type = PB_REMOTE_SERVER_EVENT_LOCAL_PACKET;
        memcpy(&pb_remote_evt.evt.pdu.payload[0], p_data, length);
        pb_remote_evt.evt.pdu.length = length;

        NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &pb_remote_evt) == NRF_SUCCESS);
        pb_remote_server_process(mp_pb_remote_server_model);
    }
}

static void pb_adv_ack_cb(prov_bearer_t * p_bearer)
{
    /* TODO: Find server model with correct provisioning context. MBTLE-994 */
    if (&mp_pb_remote_server_model->prov_bearer == p_bearer)
    {
        pb_remote_server_event_t pb_remote_evt =
            {
                .type = PB_REMOTE_SERVER_EVENT_LOCAL_ACK,
                .evt  = {{0}}
            };
        NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &pb_remote_evt) == NRF_SUCCESS);
        pb_remote_server_process(mp_pb_remote_server_model);
    }
}

static void pb_adv_link_opened_cb(prov_bearer_t * p_bearer)
{
    /* TODO: Find server model with correct provisioning context. MBTLE-994 */
    if (&mp_pb_remote_server_model->prov_bearer == p_bearer)
    {
        pb_remote_server_event_t pb_remote_evt =
            {
                .type = PB_REMOTE_SERVER_EVENT_LINK_ESTABLISHED,
                .evt  = {{0}}
            };

        NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &pb_remote_evt) == NRF_SUCCESS);

        pb_remote_server_process(mp_pb_remote_server_model);
    }
}

static void pb_adv_link_closed_cb(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t reason)
{
    /* TODO: Find server model with correct provisioning context. MBTLE-994 */
    if (&mp_pb_remote_server_model->prov_bearer == p_bearer)
    {
        pb_remote_server_event_t pb_remote_evt =
            {
                .type = PB_REMOTE_SERVER_EVENT_LINK_CLOSED,
                .evt.link_close_reason = reason
            };
        NRF_MESH_ASSERT(fifo_push(&m_pbr_server_event_queue, &pb_remote_evt) == NRF_SUCCESS);
        pb_remote_server_process(mp_pb_remote_server_model);
    }
}

/*******************************************************************************
 * Public API
 *******************************************************************************/

uint32_t pb_remote_server_init(pb_remote_server_t * p_remote_server, uint16_t element_index)
{
    if (NULL == p_remote_server)
    {
        return NRF_ERROR_NULL;
    }
    else if (PB_REMOTE_SERVER_STATE_NONE != p_remote_server->state)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    /* TODO: To enable concurrency, these FIFOs must be kept within the context struct somehow or
     * another solution for retaining events must be found. */
    m_pbr_server_event_queue.elem_array = &m_pbr_server_event_queue_buffer[0];
    m_pbr_server_event_queue.elem_size  = sizeof(pb_remote_server_event_t);
    m_pbr_server_event_queue.array_len  = PB_REMOTE_SERVER_EVENT_QUEUE_SIZE;

    fifo_init(&m_pbr_server_event_queue);

    m_pbr_server_alt_event_queue.array_len  = PB_REMOTE_SERVER_ALT_EVENT_QUEUE_SIZE;
    m_pbr_server_alt_event_queue.elem_array = &m_pbr_server_alt_event_queue_buffer[0];
    m_pbr_server_alt_event_queue.elem_size  = sizeof(pb_remote_server_event_t);
    fifo_init(&m_pbr_server_alt_event_queue);

    m_is_interrupting = false;

    uint32_t status = prov_init(&p_remote_server->prov_bearer,
                       prov_bearer_adv_interface_get(),
                       &m_prov_callbacks,
                       PROV_PROVISIONING_LINK_TIMEOUT_MIN_US);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    access_model_add_params_t init_params;
    init_params.element_index = element_index;
    init_params.model_id.model_id = PB_REMOTE_SERVER_MODEL_ID;
    init_params.model_id.company_id = ACCESS_COMPANY_ID_NONE;
    init_params.p_opcode_handlers = &m_opcode_handlers[0];
    init_params.opcode_count = sizeof(m_opcode_handlers)/sizeof(m_opcode_handlers[0]);
    init_params.p_args = p_remote_server;
    init_params.publish_timeout_cb = NULL;

    status = access_model_add(&init_params, &p_remote_server->model_handle);
    if (status != NRF_SUCCESS)
    {
        return status;
    }

    /* TODO: Track state in another way and allocate this struct on stack when it's needed. */
    p_remote_server->reliable.model_handle = p_remote_server->model_handle;
    p_remote_server->reliable.status_cb = server_reliable_status_cb;
    p_remote_server->reliable.timeout = ACCESS_RELIABLE_TIMEOUT_MIN;
    p_remote_server->state = PB_REMOTE_SERVER_STATE_DISABLED;

    mp_pb_remote_server_model = NULL;
    return NRF_SUCCESS;
}

uint32_t pb_remote_server_enable(pb_remote_server_t * p_remote_server)
{
    if (NULL == p_remote_server)
    {
        return NRF_ERROR_NULL;
    }
    else if (PB_REMOTE_SERVER_STATE_DISABLED != p_remote_server->state ||
             mp_pb_remote_server_model != NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    m_event_handler.evt_cb = pb_remote_server_mesh_evt_cb;
    nrf_mesh_evt_handler_add(&m_event_handler);
    p_remote_server->state      = PB_REMOTE_SERVER_STATE_IDLE;
    p_remote_server->prev_state = PB_REMOTE_SERVER_STATE_IDLE;
    mp_pb_remote_server_model = p_remote_server;
    return NRF_SUCCESS;
}

uint32_t pb_remote_server_disable(pb_remote_server_t * p_remote_server)
{
    if (NULL == p_remote_server)
    {
        return NRF_ERROR_NULL;
    }
    else if (PB_REMOTE_SERVER_STATE_IDLE != p_remote_server->state ||
             PB_REMOTE_SERVER_STATE_SCANNING != p_remote_server->state)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    fifo_flush(&m_pbr_server_event_queue);
    fifo_flush(&m_pbr_server_alt_event_queue);

    nrf_mesh_evt_handler_remove(&m_event_handler);
    p_remote_server->state      = PB_REMOTE_SERVER_STATE_DISABLED;
    p_remote_server->prev_state = PB_REMOTE_SERVER_STATE_DISABLED;
    mp_pb_remote_server_model = NULL;
    return NRF_SUCCESS;
}

uint32_t pb_remote_server_return_to_scan_set(pb_remote_server_t * p_server, bool state)
{
    if (p_server == NULL)
    {
        return NRF_ERROR_NULL;
    }
    else
    {
        p_server->return_to_scan_enabled = state;
        return NRF_SUCCESS;
    }
}
